app/Controllers/Home.php

    public function index()
    {
        $BannerModel = new BannerModel();
        $banners = $BannerModel->getBanner();

        $data['banners'] = $banners;
        helper(['form','url','cart']);
        $categoriasmodel=new categoria_model();
        $data['categorias']=$categoriasmodel->getCategorias();
        $session=session();
        $productModel = new productModel();

        $data['producto'] = $productModel->orderBy('id', 'DESC')->findAll(); // Recupera todos los productos desde el modelo
---
SELECT *
FROM `producto`
ORDER BY `id` DESC