app/Controllers/VentasController.php

public function comprar_carrito()
{
    $cart = \Config\Services::cart();
    $productos = $cart->contents();
    $request = \Config\Services::request();
    $montoTotal = 0;

    foreach ($productos as $producto) {
        $montoTotal += $producto["price"] * $producto["qty"];
    }

    $ventaCabecera = new Ventas_cabecera_model();
    $id_session=intval(session()->id);

    $fechaActual = date('Y-m-d H:i:s'); // Obtener la fecha actual en el formato deseado

    $idcabecera = $ventaCabecera->insert([
        "total_venta" => $montoTotal,
        "usuario_id" => $id_session,
        "fecha" => $fechaActual // Agregar la fecha actual al array de datos
    ]);
    $ventaDetalle = new Ventas_detalle_model();
    $productModel = new productModel();

    foreach ($productos as $producto) {
        $ventaDetalle->insert([
            "venta_id" => $idcabecera,
            "producto_id" => $producto['id'],
            "cantidad" => $producto["qty"],
            "precio" => $producto["price"]
        ]);
---
INSERT INTO `ventas_cabecera` (`total_venta`, `usuario_id`, `fecha`) VALUES (17000, 5, '2023-06-14')
INSERT INTO `ventas_detalle` (`venta_id`, `producto_id`, `cantidad`, `precio`) VALUES (32, '12', 1, 17000)

            // Restar la cantidad del carrito al stock actual
            $newStock = $stock - $producto["qty"];

        $productModel->update($producto["id"], ['stock' => $newStock]);
---
UPDATE `producto` SET `stock` = 4
WHERE `producto`.`id` IN ('12')