app/Models/BannerModel.php

    public function getBanner(){
        return $this->findAll();
---
SELECT *
FROM `banner`