app/Models/FavoritosModel.php

    public function getFavoritosByUser($userId)
    {
        return $this->select('favoritos.*, producto.*')
            ->join('producto', 'producto.id = favoritos.producto_id')
            ->where('favoritos.usuario_id', $userId)
            ->findAll();
---
SELECT `favoritos`.*, `producto`.*
FROM `favoritos`
JOIN `producto` ON `producto`.`id` = `favoritos`.`producto_id`
WHERE `favoritos`.`usuario_id` = '5'